blog/2014-05-25-grep-and-find.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Sunday, December  4, 2022 at  4:43 PM -->
<meta charset="utf-8" />
<title>Grep and Find</title>
<meta name="author" content="Kinhung Lam" />
<meta name="generator" content="Org Mode" />
<meta name="twitter:site" content="@twylo" />
<meta name="twitter:creator" content="@twylo" />
<meta name="viewport" content="width=device-width, initial-scale=1.0" />
<link rel="me" href="https://weibo.com/u/2150445074" />
<link rel="icon" type="image/png" href="/images/icon/favicon-32x32.png" />
<link rel="apple-touch-icon-precomposed" href="/images/icon/apple-touch-icon.png" />
<link rel="alternate" type="application/rss+xml" title="Weblog RSS Feed" href="/blog/rss.xml" />
<link rel="stylesheet" type="text/css" href="/res/faces.css">
<link rel="stylesheet" type="text/css" href="/res/style.css">
</head>
<body>
<div id="preamble" class="status">
<a class="skip-nav-link" href="#content">
  Skip navigation
</a>
<nav>
  <div class="navitem"><a href="/">Home</a></div>
  <div class="navitem"><a href="/blog/">Weblog</a></div>
  <div class="navitem"><a href="/portfolio/">Portfolio</a></div>
  <div class="navitem"><a href="/resume.html">Resume</a></div>
  <div class="navitem"><a href="/contact.html">Contact</a></div>
</nav>
<div class="published">
Published Sunday, May 25, 2014 at  5:54 PM
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Grep and Find</h1>
</header><p>
##grep ###1.从文件中查找关键词 <b>grep 'linux' text.txt //查找包含
linux的关键词</b>
</p>

<pre class="example" id="orgf547482">
[root@localhost ~]# grep 'root' /etc/group
root:x:0:root
bin:x:1:root,bin,daemon
</pre>

<p>
###2.从多个文件中查找关键词
</p>

<pre class="example" id="org60f645d">
[root@localhost ~]# grep 'root' /etc/group /etc/my.cnf
/etc/group:root:x:0:root
/etc/my.cnf:user = root
</pre>

<p>
###3.查找当前目录下以及下辖子目录下所有包含str字符串的文件,会列出文件名.以及该行的内容.以及行号
</p>

<p>
<b>-n是打印行号，-r是在子目录也要查询</b>
</p>

<pre class="example" id="org0cb88b7">
grep -n "str" -r ./
</pre>

<p>
<b>用 -i 搜索的时候可以忽略大小写</b>
</p>

<p>
<b>利用 -r 来完成所有的子目录下面执行相应的查找</b>
</p>

<p>
<b>用-l是打印所有的结果</b>
</p>

<pre class="example" id="org8ecad27">
grep -ril 'str' ./
</pre>

<p>
##find 是查找文件的常用命令
</p>

<p>
###1.查找在 /etc 目录下所有文件名中含有 mail 的文件
</p>

<pre class="example" id="orgc5d28d8">
[root@localhost ]# find /etc/ -name '*mail*'
/etc/mail.rc
/etc/rc.d/rc5.d/K30sendmail
/etc/rc.d/rc4.d/K30sendmail
</pre>

<p>
###2.查找文件大小超过指定值的文件
</p>

<pre class="example" id="org0f240aa">
[root@localhost ]# find ./ -type f -size +100M
./test.sql
</pre>

<p>
###3.最近几天被修改过的文件
</p>

<pre class="example" id="org39325fe">
find . -mtime -2 
</pre>
</div>
<div id="postamble" class="status">
<div id="footer">
Proudly <a href="https://kinhung.me/blog/0110_emacs_blogging_for_fun_and_profit.html">published</a> with <a href="https://www.gnu.org/software/emacs/">Emacs</a> and <a href="https://orgmode.org/">Org Mode</a>. This work is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by-sa/4.0/">CC BY-SA 4.0</a> License. <a href="https://kinhung.me/privacy.html">Privacy Policy</a></div>
</div>
</body>
</html>
